public class Main {

    public static void main(String[] args) {

       for (int x=0; x<10; x++){
           System.out.println("I want to learn programming that is why I study Java");
       }
    }
}



/*
Меркантильные намерения
Вывести на экран десять раз надпись «Я хочу большую зарплату, и для этого изучаю Java»
Требования:
1. Программа не должна считывать данные с клавиатуры.
2. Программа должна выводить текст.
3. Текст должен начинаться с "Я хочу".
4. Текст должен заканчиваться на "изучаю Java".
5. Текст должен состоять из 10 строк.
6. Выводимый текст должен соответствовать заданию.
 */